// Дано целое число в диапазоне 100–999. Вывести строку-описание
// данного числа, например: 256 — «двести пятьдесят шесть», 814 — «во-
// семьсот четырнадцать»
package main

import (
	"fmt"

	"github.com/dreddsa5dies/1000GoExamples/ioutil"
)

func main() {
	var m int

	for m < 100 || m > 999 {
		m = ioutil.Integer("число")
	}

	fmt.Printf("%v\n", printInt(m))
}

func printInt(m int) string {
	var w1, w2, w3 string
	switch {
	case (m / 100) == 1:
		w1 = "сто"
	case (m / 100) == 2:
		w1 = "двести"
	case (m / 100) == 3:
		w1 = "триста"
	case (m / 100) == 4:
		w1 = "четыреста"
	case (m / 100) == 5:
		w1 = "пятьсот"
	case (m / 100) == 6:
		w1 = "шестьсот"
	case (m / 100) == 7:
		w1 = "семьсот"
	case (m / 100) == 8:
		w1 = "восемьсот"
	case (m / 100) == 9:
		w1 = "деятьсот"
	}

	switch {
	case (m-(100*(m/100)))/10 == 1:
		w2 = "десять"
	case (m-(100*(m/100)))/10 == 2:
		w2 = "двадцать"
	case (m-(100*(m/100)))/10 == 3:
		w2 = "тридцать"
	case (m-(100*(m/100)))/10 == 4:
		w2 = "сорок"
	case (m-(100*(m/100)))/10 == 5:
		w2 = "пятьдесят"
	case (m-(100*(m/100)))/10 == 6:
		w2 = "шестьдесять"
	case (m-(100*(m/100)))/10 == 7:
		w2 = "семьдесять"
	case (m-(100*(m/100)))/10 == 8:
		w2 = "восемьдесять"
	case (m-(100*(m/100)))/10 == 9:
		w2 = "девяносто"
	}

	switch {
	case m%10 == 1:
		w3 = "один"
	case m%10 == 2:
		w3 = "два"
	case m%10 == 3:
		w3 = "три"
	case m%10 == 4:
		w3 = "четыре"
	case m%10 == 5:
		w3 = "пять"
	case m%10 == 6:
		w3 = "шесть"
	case m%10 == 7:
		w3 = "семь"
	case m%10 == 8:
		w3 = "восемь"
	case m%10 == 9:
		w3 = "девять"
	}

	switch {
	case (m - 100*(m/100)) == 11:
		w2 = "одинадцать"
		w3 = ""
	case (m - 100*(m/100)) == 12:
		w2 = "двенадцать"
		w3 = ""
	case (m - 100*(m/100)) == 13:
		w2 = "тринадцать"
		w3 = ""
	case (m - 100*(m/100)) == 14:
		w2 = "четырнадцать"
		w3 = ""
	case (m - 100*(m/100)) == 15:
		w2 = "пятьнадцать"
		w3 = ""
	case (m - 100*(m/100)) == 16:
		w2 = "шестьнадцать"
		w3 = ""
	case (m - 100*(m/100)) == 17:
		w2 = "семьнадцать"
		w3 = ""
	case (m - 100*(m/100)) == 18:
		w2 = "восемьнадцать"
		w3 = ""
	case (m - 100*(m/100)) == 19:
		w2 = "девятьнадцать"
		w3 = ""
	}

	return w1 + " " + w2 + " " + w3
}
