// Даны два целых числа: D (день) и M (месяц), определяющие правиль-
// ную дату. Вывести знак Зодиака, соответствующий этой дате: «Водолей»
// (20.1–18.2), «Рыбы» (19.2–20.3), «Овен» (21.3–19.4), «Телец» (20.4–20.5),
// «Близнецы» (21.5–21.6), «Рак» (22.6–22.7), «Лев» (23.7–22.8), «Дева»
// (23.8–22.9), «Весы» (23.9–22.10), «Скорпион» (23.10–22.11), «Стрелец»
// (23.11–21.12), «Козерог» (22.12–19.1)
package main

import (
	"fmt"

	"github.com/dreddsa5dies/1000GoExamples/ioutil"
)

func main() {
	var m, n int
	for m < 1 || m > 12 {
		m = ioutil.Integer("месяц")
	}

	for n < 1 || n > 31 {
		m = ioutil.Integer("день")
	}

	fmt.Printf("%s\n", printZodiac(m, n))
}

func printZodiac(m, n int) string {
	var w string
	w = "Водолей"
	return w
}
