// Дано целое число в диапазоне 10–40, определяющее количество учеб-
// ных заданий по некоторой теме. Вывести строку-описание указанного ко-
// личества заданий, обеспечив правильное согласование числа со словами
// «учебное задание», например: 18 — «восемнадцать учебных заданий»,
// 23 — «двадцать три учебных задания», 31 — «тридцать одно учебное за-
// дание»
package main

import (
	"fmt"

	"github.com/dreddsa5dies/1000GoExamples/ioutil"
)

func main() {
	var (
		m          int
		w1, w2, w3 string
	)

	for m < 10 || m > 40 {
		m = ioutil.Integer("число")
	}

	w2 = "учебных"
	w3 = "заданий"

	switch {
	case m == 21:
		w1 = "двадцать одно"
		w2 = "учебное"
		w3 = "задание"
	case m == 31:
		w1 = "тридцать одно"
		w2 = "учебное"
		w3 = "задание"
	default:
		if (m / 10) == 1 {
			switch {
			case m == 11:
				w1 = "одинадцать"
			case m == 12:
				w1 = "двенадцать"
			case m == 13:
				w1 = "тринадцать"
			case m == 14:
				w1 = "четырнадцать"
			case m == 15:
				w1 = "пятнадцать"
			case m == 16:
				w1 = "шестнадцать"
			case m == 17:
				w1 = "семьнадцать"
			case m == 18:
				w1 = "восемьнадцать"
			case m == 19:
				w1 = "девятнадцать"
			}
		} else if (m / 10) == 2 {
			w1 = "двадцать"
			switch {
			case (m - 20) == 2:
				w1 += " два"
				w3 = "задания"
			case (m - 20) == 3:
				w1 += " три"
				w3 = "задания"
			case (m - 20) == 4:
				w1 += " четыре"
				w3 = "задания"
			case (m - 20) == 5:
				w1 += " пять"
			case (m - 20) == 6:
				w1 += " шесть"
			case (m - 20) == 7:
				w1 += " семь"
			case (m - 20) == 8:
				w1 += " восемь"
			case (m - 20) == 9:
				w1 += " девять"
			}
		} else if (m / 10) == 3 {
			w1 = "тридцать"
			switch {
			case (m - 30) == 2:
				w1 += " два"
				w3 = "задания"
			case (m - 30) == 3:
				w1 += " три"
				w3 = "задания"
			case (m - 30) == 4:
				w1 += " четыре"
				w3 = "задания"
			case (m - 30) == 5:
				w1 += " пять"
			case (m - 30) == 6:
				w1 += " шесть"
			case (m - 30) == 7:
				w1 += " семь"
			case (m - 30) == 8:
				w1 += " восемь"
			case (m - 30) == 9:
				w1 += " девять"
			}
		} else {
			w1 = "сорок"
		}
	}

	fmt.Printf("%v %v %v\n", w1, w2, w3)
}
